// date : 2024-02-21
// file : test01.cpp
// desc : 함수

// #include <iostream> // 헤더파일 선언문 

// 변수 : 무언가를 저장할 수 있는 공간
// 함수의 정의 : 출력 함수명(입력) {}순, 머리 3행 몸체 4~6행
// 함수 앞에 void라 되어 있으면 비어있다 라는 의미
// 뒤에 괄호가 붙는 것은 함수, 아니면 변수  // 괄호는 입력을 뜻함, 비어있으면 입력이 없음을 뜻함
// 중괄호{} 의미 : 함수의 범위를 나타냄 

/* 1. 함수 정의
void func() {      // 함수이름은 func이고  
	               // 입력은 없고 출력도 없다.					

}

void func1(int a) {		// 함수이름은 func1이고
						// 입력은 int a 이고 출력은 없다.

}

int func2() {		// 함수이름은 func2이고
					// 입력은 없고 출력은 int 이다.


  return int(정수);		// 출력이 있으면 호출하는쪽으로 return문을 작성해야 한다.
}
*/

/* 2. 함수 호출
* func();	// 함수 머리에서 출력을 생략한다.
* func1();
* func2();
*/ 

// num이라는 변수에 10을 저장하자.
// int num;	// 변수 선언을 먼저하고	// 변수는 RAM에서 할당 받는다.
// num = 10;	// 변수에 값을 대입한다.

